{
  "personal": "With a Pisces ascendant, this individual possesses a deeply compassionate and intuitive nature. They are likely highly imaginative, sensitive, and drawn to creative pursuits. The strong placement of planets in the 10th house (Sagittarius) suggests a strong sense of purpose and ambition directed towards public life or career. However, the influence of several planets there, including retrograde Mercury and Venus, indicates a need for careful planning and revisiting strategies. A Moon in Aquarius fosters a desire for independence and unconventional thinking, but can also bring emotional detachment. Mars in Scorpio grants determination and resourcefulness, but can sometimes manifest as intensity. This individual's strength lies in their empathy, creativity, and ambitious drive when channeled effectively. They are prone to introspection and can benefit from practices that ground them and bring emotional stability.",
  "career": "The concentration of planets in the 10th and 11th houses points towards a career that is public-facing and potentially involves leadership or influence. Sagittarius' energy favors fields like teaching, law, philosophy, or travel. With retrograde Mercury and Venus, communication, finance, or artistic endeavors might be suitable but require diligent attention to detail and a patient approach to overcoming initial setbacks. The presence of Rahu suggests a willingness to take unconventional routes and explore new technologies or innovative ideas. Jupiter in the 4th house suggests that a career that brings emotional satisfaction and connection to their values will be most fulfilling. Success will come from a blend of creative vision, strong work ethic, and adaptable strategies.",
  "relationships": "This individual approaches relationships with a blend of idealism (Pisces ascendant) and intellectual detachment (Aquarius Moon). They are likely drawn to partners who are intelligent, independent, and appreciate their unique perspective. The retrograde Venus in the 11th house may indicate complexities or delays in romantic relationships, or a tendency to revisit past connections. Mars in Scorpio suggests a passionate and intense love style, but it's important to manage possessiveness and control tendencies. Compatibility will be enhanced by partners who are open-minded, supportive of their ambitions, and provide a sense of emotional security. They thrive in relationships where they have space to express their individuality while feeling deeply connected. The Ketu in the 5th house might indicate a need to learn to truly enjoy romance.",
  "dos_donts": "**Dos:**\n\n*   **Do** meditate or practice mindfulness to ground your emotions and intuition.\n*   **Do** embrace your creativity and find outlets for artistic expression.\n*   **Do** carefully plan and review your strategies, especially in your career.\n*   **Do** nurture your friendships and connect with like-minded individuals.\n*   **Do** trust your intuition and pursue unconventional paths.\n\n**Don'ts:**\n\n*   **Don't** be overly critical of yourself or others.\n*   **Don't** become emotionally detached or isolate yourself.\n*   **Don't** let your passion turn into possessiveness in relationships.\n*   **Don't** neglect the details in your career or financial planning.\n*   **Don't** shy away from taking calculated risks and exploring new opportunities."
}