{
  "personal": "With a Leo Ascendant, this individual possesses a naturally charismatic and confident aura. The Sun in Aries in the 9th house indicates a strong sense of purpose and a fiery passion for knowledge, philosophy, and possibly foreign cultures or travel. This placement suggests someone who is optimistic, independent, and eager to explore the world. The Moon in Libra in the 3rd house points to a need for harmony and balance in communication and relationships with siblings or close neighbors. They are likely diplomatic, charming, and appreciate beauty. The challenge lies in finding the balance between their Leo self-assuredness and the Libra desire for approval, preventing them from being overly concerned with what others think. Overall, they are generous, creative, and have a strong desire to leave a positive impact.",
  "career": "The presence of Venus in Taurus in the 10th house of career suggests a potential for success in fields related to arts, finance, beauty, or luxury. A career that involves creativity, aesthetics, or managing resources is highly favored. The 10th house placement emphasizes stability and enjoyment in their work. With Mars and Ketu in Gemini in the 11th house, networking and communication skills are crucial for career advancement. They might find success in fields like sales, marketing, writing, or anything that requires them to interact with diverse groups of people. However, this placement also suggests a tendency to jump between ideas or lose focus, so developing discipline and sticking to their goals is important. They thrive in environments that are visually pleasing and value quality.",
  "relationships": "The Libra Moon indicates a strong desire for partnership and harmonious relationships. They seek a partner who is balanced, fair, and appreciates beauty. However, Pluto also resides in Libra, bringing intensity and potential for transformative experiences within their relationships. The placement of Saturn in Capricorn in the 6th house might indicate initial delays or challenges in finding a long-term commitment but provides the stability for lasting unions. They are likely loyal and dedicated partners, once they commit. The 7th house lord, Saturn, being placed in the 6th may also indicate health-related issues within relationships, so emphasizing a healthy lifestyle in relationships is crucial. They should avoid getting caught up in superficial aspects of relationships and focus on building genuine connections.",
  "dos_donts": "**Do's:**\n\n*   **Cultivate Self-Awareness:** Embrace your Leo charisma while balancing it with Libra's diplomacy.\n*   **Focus on Communication:** Nurture your communication skills for effective networking.\n*   **Embrace Beauty in Your Work:** Seek careers that align with your Venusian appreciation for aesthetics.\n*   **Ground Your Spiritual Insights:** Find practical ways to apply the wisdom gained through your 9th house Aries Sun.\n*   **Practice Discipline:** Overcome the scattering effect of Ketu in Gemini by setting clear goals.\n\n**Don'ts:**\n\n*   **Over-Commit:** Avoid spreading yourself too thin with the Gemini influence.\n*   **Become Overly Dependent:** Strive for independence and avoid relying solely on the opinions of others.\n*   **Ignore Practical Matters:** Don't let your idealism overshadow the practicalities of life, especially in relationships.\n*   **Suppress Your Creativity:** Allow time for creative pursuits to channel your Leo energy.\n*   **Overthink and Overanalyze:** Trust your intuition and avoid getting caught in obsessive thought patterns, especially due to Pluto's influence."
}