{
  "personal": "With a Cancer Ascendant, this individual is likely deeply empathetic, nurturing, and protective. The Moon in Leo in the 2nd house suggests a strong emotional connection to family, values, and resources, and a tendency to express emotions creatively and dramatically. This person thrives in environments where they feel secure and valued. They have a natural inclination to care for others, making them good listeners and compassionate friends. However, they must be mindful of becoming overly sensitive or possessive, learning to balance their emotional needs with those of others. The presence of Maandi in the ascendant can sometimes create internal anxieties or a sense of being misunderstood, requiring self-awareness and conscious effort to maintain a positive outlook.",
  "career": "The placement of Mercury and Rahu in Aries in the 10th house indicates a dynamic and innovative approach to career. This person may excel in fields that require communication, technology, or entrepreneurial skills. They are likely to be assertive, driven, and quick to take the initiative. However, they need to be cautious of impulsivity and avoid taking shortcuts that could compromise their integrity. The Sun in Taurus in the 11th house of gains suggests a desire for financial stability and a focus on building networks. They might find success in fields related to finance, arts, or creative industries where they can leverage their practical skills and social connections. The position of Mars in the 6th house of service can indicate success in service oriented roles that require discipline and attention to detail.",
  "relationships": "This individual approaches relationships with a blend of emotional depth and a desire for stability, influenced by their Cancer Ascendant and Moon in Leo. They are likely to be loyal and devoted partners, but they need to avoid being overly clingy or demanding. Venus in Gemini in the 12th house suggests a playful and intellectual approach to love, with a need for variety and mental stimulation in their partnerships. There could be hidden or unconventional aspects to their romantic life. Ketu in Libra in the 4th house indicates detachment from family dynamics or a past-life connection to relationships, requiring them to learn to balance their personal needs with those of their family. Overall, understanding and open communication will be vital for maintaining harmonious relationships.",
  "dos_donts": "**Dos:**\n\n*   **Cultivate Emotional Intelligence:** Learn to understand and manage your emotions effectively.\n*   **Network Strategically:** Nurture relationships that can benefit your career and personal growth.\n*   **Embrace Innovation:** Explore new ideas and technologies in your professional pursuits.\n*   **Practice Assertiveness:** Communicate your needs and boundaries clearly and respectfully.\n*   **Find a Creative Outlet:** Express your emotions and find balance through artistic or creative activities.\n\n**Donts:**\n\n*   **Become Overly Possessive:** Avoid being clingy or controlling in relationships.\n*   **Act Impulsively:** Think before you speak or act, especially in career matters.\n*   **Compromise Your Values:** Maintain integrity and ethical conduct in all your dealings.\n*   **Suppress Your Emotions:** Acknowledge and process your feelings in a healthy way.\n*   **Neglect Your Health:** Prioritize physical and mental well-being for optimal functioning."
}