{
  "personal": "With a Scorpio Ascendant, you possess an intensely observant and transformative nature. Your core strength lies in your determination and ability to delve deep into any subject or situation. The Moon in Cancer in the 9th house indicates a nurturing and emotionally intelligent mind, drawn to spirituality and higher knowledge. This placement also suggests a strong connection to your mother or maternal figures and a desire to create a secure emotional foundation. While you can be reserved initially, your strong will and emotional depth make you a loyal and empathetic individual. Your Sun in Aries in the 6th house brings initiative and a proactive approach to challenges, making you resilient and hardworking, but perhaps prone to taking on too much.",
  "career": "Your Jupiter in Leo in the 10th house of career suggests a path where creativity, leadership, and public recognition are possible. Consider careers in fields where you can shine, such as teaching, management, or creative arts like design or entertainment. Your work style is likely enthusiastic and driven, with a desire to inspire others. The 6th house planets (Sun, Mercury, Venus) suggest a strong work ethic and attention to detail. However, be mindful of potential conflicts within the workplace due to Venus being weak in Vimsopaka. Success will come from developing your leadership skills, embracing your creative talents, and cultivating positive relationships with colleagues.",
  "relationships": "The 7th house of relationships is ruled by Venus, placed in the 6th house. This suggests that your partnerships may often begin through work or shared interests. You value stability and security in relationships and are drawn to partners who are intelligent and communicative. The Mars in Pisces placement can sometimes lead to idealizing partners, so ground your expectations in reality. The Moon in Cancer indicates a desire for a nurturing and emotionally supportive partner. Building strong communication and addressing any conflicts related to work-related stress will be key to harmonious partnerships. Be aware of your tendency to be intensely devoted, and allow space for your partner's individuality.",
  "dos_donts": "**Do's:**\n\n*   **Cultivate Self-Awareness:** Regularly reflect on your emotions and motivations to understand your intense Scorpio nature.\n*   **Embrace Creative Outlets:** Explore activities like writing, painting, or music to express your inner world and balance work.\n*   **Practice Mindfulness:** Use meditation or yoga to manage stress and improve emotional regulation.\n*   **Set Clear Boundaries at Work:** Avoid overcommitting and prioritize your well-being alongside your career goals.\n*   **Focus on Open Communication:** In relationships, express your needs and actively listen to your partner's perspective.\n\n**Don'ts:**\n\n*   **Suppress Your Emotions:** Acknowledge and process your feelings, even the difficult ones, to avoid emotional build-up.\n*   **Become Overly Critical:** Guard against perfectionism and extend compassion to yourself and others.\n*   **Isolate Yourself:** Make an effort to connect with friends and family to build a supportive network.\n*   **Avoid Confrontation:** Address conflicts directly and constructively, rather than letting them fester.\n*   **Idealize Partners:** Maintain realistic expectations in relationships and appreciate your partner's flaws as well as strengths."
}