{
  "personal": "With a Cancer Ascendant, you are likely a sensitive, nurturing, and emotionally driven individual. The Moon, the Ascendant lord, in Leo in the 2nd house suggests a warm and expressive personality, valuing family and security, and potentially having a flair for communication and a need for recognition. The strong Mars in Sagittarius indicates courage, optimism, and a love for adventure. However, Saturn in Scorpio in the 5th house might create challenges in expressing creativity freely or finding easy fulfillment in romance or children. Overall, you are a caring individual with a strong will, capable of achieving great things once you overcome internal blocks and learn to trust your intuition. The current Ketu-Moon dasha may bring a focus on internal reflection and emotional processing, potentially requiring introspection to understand your inner landscape.",
  "career": "Mercury, the planet of intellect and communication, in Aries in the 10th house signifies a dynamic and decisive approach to career. You likely thrive in roles that demand quick thinking, innovation, and leadership. Fields like marketing, communications, entrepreneurship, or any career involving public speaking or problem-solving could be suitable. Rahu's presence in the 10th house suggests a desire for unconventional career paths and a willingness to take risks. Success will come from leveraging your sharp intellect, communication skills, and ability to think outside the box. Be mindful of impulsiveness and learn to strategically plan your actions for long-term success. Don't be afraid to embrace new technologies and trends.",
  "relationships": "Venus in Gemini in the 12th house suggests a playful, intellectual, and somewhat detached approach to love. You are attracted to witty and communicative partners who can keep you mentally stimulated. However, the 12th house placement can also indicate a tendency towards secret affairs or difficulties in expressing your romantic feelings openly. The Saturn in Scorpio in the 5th house can also lead to delays and challenges in romantic relationships. Finding a partner who understands your need for intellectual stimulation and personal space is crucial. Focus on building trust and open communication to avoid misunderstandings. Compatibility may be found with those who have strong Air or Fire signs in their charts. Be aware of a tendency to idealize partners and focus on realistic expectations.",
  "dos_donts": "**Dos:**\n\n*   **Nurture your creativity:** Despite Saturn's placement, actively engage in creative pursuits like writing, art, or music.\n*   **Communicate openly:** Express your feelings and needs clearly to avoid misunderstandings in relationships and at work.\n*   **Embrace learning:** Continuously seek new knowledge and skills to stay ahead in your career.\n*   **Trust your intuition:** Cancer Ascendants have strong intuition; listen to your inner voice.\n*   **Practice self-care:** Prioritize activities that bring you emotional and mental peace.\n\n**Don'ts:**\n\n*   **Be overly critical of yourself:** Saturn's influence can lead to self-doubt. Practice self-compassion.\n*   **Suppress your emotions:** Acknowledge and process your feelings healthily.\n*   **Be impulsive:** Think before you act, especially in career-related decisions.\n*   **Avoid commitments:** Face the challenges in your romantic relationship head on instead of running away.\n*   **Get lost in daydreams:** Ground yourself in reality and focus on tangible goals."
}