{
  "personal": "With a Cancer Ascendant, this individual is deeply empathetic and nurturing, guided by emotions. The Moon in Leo in the 2nd house signifies a need for recognition and appreciation, and a potential flair for communication or artistic expression. The placement suggests resources are linked to how they express themselves and their self-worth. A strong Mars in Sagittarius in the 6th house demonstrates a courageous and adventurous spirit in overcoming challenges and serving others. However, the influence of Saturn retrograde in Scorpio in the 5th house could indicate some early struggles or delays around creativity, children, and self-expression requiring patience and inner work. Overall, a caring, courageous and passionate personality marked by the potential for deep insight and self-transformation.",
  "career": "Mercury and Rahu conjunction in Aries in the 10th house suggests a dynamic and innovative approach to career. Suitable paths include roles that require quick thinking, problem-solving, and a pioneering spirit such as technology, communication, or entrepreneurial ventures. The individual likely thrives in environments that are fast-paced and constantly evolving. The influence of Rahu adds an element of ambition and unconventional thinking, potentially leading to success in fields that break with tradition. Be mindful of being too impulsive and make sure to temper enthusiasm with practicality. Focus should be on developing skills in strategic planning to channel creative energy effectively for long-term success.",
  "relationships": "Venus in Gemini in the 12th house indicates a romantic nature and a love of intellectual stimulation in relationships. This placement suggests a playful and adaptable approach to partnership, but might also signify a tendency towards secret or hidden affairs. The presence of Ketu in Libra in the 4th house could signify a detachment from family dynamics, or lessons that can be found with a focus on inner stability and peace. Compatibility is likely found with partners who are intellectually engaging, communicative, and value personal freedom. The emotional depth of the Cancer Ascendant and Leo Moon suggests a strong need for emotional connection and validation in relationships, so finding a balance between intellect and emotions is key for harmonious partnerships.",
  "dos_donts": "**Dos:**\n\n*   **Do** embrace your creative talents and find outlets for self-expression, especially through communication (Moon in Leo).\n*   **Do** channel your Mars energy into positive action, such as exercise, service, or pursuing your goals with courage.\n*   **Do** cultivate patience and perseverance when facing challenges, particularly related to children or creative projects (Saturn retrograde in 5th).\n*   **Do** embrace innovation and new ideas in your career, leveraging your quick-thinking abilities (Mercury/Rahu in 10th).\n*   **Do** prioritize open and honest communication in your relationships to build trust and intimacy (Venus in Gemini).\n\n**Donts:**\n\n*   **Don't** let emotions dictate your actions; strive for balance and consider practical consequences (Cancer Ascendant caution).\n*   **Don't** be impulsive or reckless in your career decisions; think strategically and avoid unnecessary risks (Rahu in 10th).\n*   **Don't** suppress your need for recognition and appreciation; communicate your needs clearly and confidently (Moon in Leo).\n*   **Don't** dwell on past hurts or family issues; focus on building a stable and supportive inner foundation (Ketu in 4th).\n*   **Don't** allow fear of failure to hold you back from pursuing your passions; embrace challenges as opportunities for growth."
}