{
  "personal": "With a Libra ascendant, you possess a natural charm, diplomacy, and a strong desire for harmony and balance in your life. Pluto's presence in the first house suggests an intense and transformative nature. You may have experienced significant personal changes and a constant drive for self-improvement. The Moon in Cancer in the 10th house indicates a deep emotional connection to your career and public image. You likely value security and nurturing in your professional life. Jupiter in the 11th house amplifies your social connections and provides a strong network that supports your goals. Your strength lies in your ability to connect with others, mediate conflicts, and create a sense of peace and beauty around you. However, your tendency to avoid conflict and over-compromise needs to be balanced with assertive self-expression.",
  "career": "Your chart suggests success in fields that require diplomacy, negotiation, and artistic expression. Consider careers in law, counseling, interior design, fashion, event planning, or the arts. The Moon in Cancer in the 10th house signifies success in nurturing roles and those involving public service, hospitality, or working with children. Jupiter in the 11th house indicates a strong potential for success through networking, group projects, and large organizations. Your work style is likely collaborative, and you thrive in environments where you can contribute your unique perspective and create harmony. Avoid jobs that demand excessive aggression or competition. Focusing on building strong relationships and leveraging your natural charm will significantly contribute to your professional success.",
  "relationships": "You approach relationships with a strong desire for balance and fairness. The Sun, Mercury, and Venus in Aries in the 7th house indicate that you seek a dynamic and intellectual partnership. You appreciate a partner who is independent, assertive, and shares your enthusiasm for life. The placement of these planets can also suggest initial impulsiveness in relationships, so developing patience is key. Compatibility is enhanced with partners who appreciate your need for fairness and are willing to communicate openly. Pay attention to the sign on the 5th house cusp, as this can provide further insight into your romantic preferences. While you value harmony, avoid suppressing your own needs to maintain peace. Seek partners who value your individuality and support your personal growth.",
  "dos_donts": "**Dos:**\n\n*   **Cultivate diplomacy:** Use your natural Libra charm to navigate conflicts and build strong relationships.\n*   **Embrace artistic expression:** Explore creative outlets to channel your inner emotions and find fulfillment.\n*   **Network actively:** Nurture your connections with others, as Jupiter in the 11th house signifies success through social circles.\n*   **Advocate for fairness:** Stand up for your principles and fight for what you believe is just.\n*   **Prioritize self-care:** Balance your desire for harmony with taking time for your own needs and well-being.\n\n**Donts:**\n\n*   **Avoid over-compromising:** Be mindful of giving too much and neglecting your own needs in relationships.\n*   **Suppress anger:** Find healthy ways to express your emotions rather than bottling them up.\n*   **Be afraid of conflict:** Address issues directly and assertively, rather than avoiding confrontation.\n*   **Neglect financial planning:** With Saturn in the 4th house, focusing on long-term security provides stability.\n*   **Rely solely on others for validation:** Develop a strong sense of self-worth that comes from within."
}